----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1            [-1, 8, 26, 26]              72
              ReLU-2            [-1, 8, 26, 26]               0
       BatchNorm2d-3            [-1, 8, 26, 26]              16
           Dropout-4            [-1, 8, 26, 26]               0
            Conv2d-5            [-1, 8, 24, 24]             576
              ReLU-6            [-1, 8, 24, 24]               0
       BatchNorm2d-7            [-1, 8, 24, 24]              16
           Dropout-8            [-1, 8, 24, 24]               0
            Conv2d-9            [-1, 8, 22, 22]             576
        MaxPool2d-10            [-1, 8, 11, 11]               0
           Conv2d-11             [-1, 10, 9, 9]             720
             ReLU-12             [-1, 10, 9, 9]               0
      BatchNorm2d-13             [-1, 10, 9, 9]              20
          Dropout-14             [-1, 10, 9, 9]               0
           Conv2d-15             [-1, 16, 7, 7]           1,440
             ReLU-16             [-1, 16, 7, 7]               0
      BatchNorm2d-17             [-1, 16, 7, 7]              32
          Dropout-18             [-1, 16, 7, 7]               0
           Conv2d-19             [-1, 16, 5, 5]           2,304
             ReLU-20             [-1, 16, 5, 5]               0
      BatchNorm2d-21             [-1, 16, 5, 5]              32
          Dropout-22             [-1, 16, 5, 5]               0
        MaxPool2d-23             [-1, 16, 2, 2]               0
           Conv2d-24             [-1, 10, 2, 2]           1,440
             ReLU-25             [-1, 10, 2, 2]               0
      BatchNorm2d-26             [-1, 10, 2, 2]              20
          Dropout-27             [-1, 10, 2, 2]               0
AdaptiveAvgPool2d-28             [-1, 10, 1, 1]               0
================================================================
Total params: 7,264
Trainable params: 7,264
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.00
Forward/backward pass size (MB): 0.41
Params size (MB): 0.03
Estimated Total Size (MB): 0.44
----------------------------------------------------------------
